<?php

namespace App\DataFixtures;

use App\Entity\Detail;
use Doctrine\Bundle\FixturesBundle\Fixture;
use Doctrine\Common\DataFixtures\DependentFixtureInterface;
use Doctrine\Persistence\ObjectManager;

class DetailFixtures extends Fixture implements DependentFixtureInterface
{
    public function load(ObjectManager $manager)
    {
        $detail = null;
        foreach (static::getInfo() as $item) {
            $tm = $this->getReference("technological_map_$item[3]");
            $detail = $this->createDetail($item[0], $item[1], $item[2], $tm);
            $manager->persist($detail);
            $this->addReference("detail_$item[4]", $detail);
        }
        $manager->flush();
    }

    private function createDetail(
        $name,
        $batch,
        $status,
        $tm
    ): Detail
    {
        return (new Detail())
            ->setName($name)
            ->setBatch($batch)
            ->setStatus($status)
            ->setTechnologicalMap($tm)
        ;
    }

    private static function getInfo(): array
    {
        return [
            ['Планка №1 (партия 1) 1', 1, 3, 1, 1],
            ['Планка №1 (партия 1) 2', 1, 4, 1, 2],
            ['Планка №1 (партия 1) 3', 1, 4, 1, 3],
            ['Планка №1 (партия 1) 4', 1, 2, 1, 4],
            ['Планка №1 (партия 1) 5', 1, 2, 1, 5],
            ['Планка №1 (партия 1) 6', 1, 2, 1, 6],
            ['Планка №1 (партия 1) 7', 1, 2, 1, 7],
            ['Планка №1 (партия 1) 8', 1, 2, 1, 8],
            ['Планка №1 (партия 1) 9', 1, 2, 1, 9],
            ['Планка №1 (партия 1) 10', 1, 2, 1, 10],

            ['Планка №1 (партия 2) 1', 2, 2, 1, 11],
            ['Планка №1 (партия 2) 2', 2, 2, 1, 12],
            ['Планка №1 (партия 2) 3', 2, 2, 1, 13],
            ['Планка №1 (партия 2) 4', 2, 2, 1, 14],
            ['Планка №1 (партия 2) 5', 2, 2, 1, 15],
            ['Планка №1 (партия 2) 6', 2, 2, 1, 16],
            ['Планка №1 (партия 2) 7', 2, 2, 1, 17],
            ['Планка №1 (партия 2) 8', 2, 2, 1, 18],
            ['Планка №1 (партия 2) 9', 2, 2, 1, 19],

            ['Планка №1 (партия 3) 0', 3, 2, 1, 20],
            ['Планка №1 (партия 3) 2', 3, 2, 1, 21],
            ['Планка №1 (партия 3) 3', 3, 2, 1, 22],
            ['Планка №1 (партия 3) 4', 3, 2, 1, 23],
            ['Планка №1 (партия 3) 5', 3, 2, 1, 24],
            ['Планка №1 (партия 3) 6', 3, 3, 1, 25],
            ['Планка №1 (партия 3) 7', 3, 3, 1, 26],
            ['Планка №1 (партия 3) 8', 3, 3, 1, 27],
            ['Планка №1 (партия 3) 9', 3, 3, 1, 28],
            ['Планка №1 (партия 3) 10', 3, 1, 1, 29],

            ['Втулка №1 (партия 4) 0', 4, 3, 2,  30],
            ['Втулка №1 (партия 4) 2', 4, 3, 2,  31],
            ['Втулка №1 (партия 4) 3', 4, 3, 2,  32],
            ['Втулка №1 (партия 4) 4', 4, 3, 2,  33],
            ['Втулка №1 (партия 4) 5', 4, 3, 2,  34],
            ['Втулка №1 (партия 4) 6', 4, 3, 2,  35],
            ['Втулка №1 (партия 4) 7', 4, 3, 2,  36],
            ['Втулка №1 (партия 4) 8', 4, 3, 2,  37],
            ['Втулка №1 (партия 4) 9', 4, 3, 2,  38],
            ['Втулка №1 (партия 4) 10', 4, 1, 2, 39],

            ['Втулка №1 (партия 5) 0', 5, 1, 2,  40],
            ['Втулка №1 (партия 5) 2', 5, 2, 2,  41],
            ['Втулка №1 (партия 5) 3', 5, 2, 2,  42],
            ['Втулка №1 (партия 5) 4', 5, 2, 2,  43],
            ['Втулка №1 (партия 5) 5', 5, 2, 2,  44],
            ['Втулка №1 (партия 5) 6', 5, 2, 2,  45],
            ['Втулка №1 (партия 5) 7', 5, 2, 2,  46],
            ['Втулка №1 (партия 5) 8', 5, 1, 2,  47],
            ['Втулка №1 (партия 5) 9', 5, 1, 2,  48],
            ['Втулка №1 (партия 5) 10', 5, 1, 2, 49],

            ['Втулка №1 (партия 6) 0', 6, 1, 2,  50],
            ['Втулка №1 (партия 6) 2', 6, 3, 2,  51],
            ['Втулка №1 (партия 6) 3', 6, 3, 2,  52],
            ['Втулка №1 (партия 6) 4', 6, 3, 2,  53],
            ['Втулка №1 (партия 6) 5', 6, 3, 2,  54],
            ['Втулка №1 (партия 6) 6', 6, 3, 2,  55],
            ['Втулка №1 (партия 6) 7', 6, 3, 2,  56],
            ['Втулка №1 (партия 6) 8', 6, 3, 2,  57],
            ['Втулка №1 (партия 6) 9', 6, 3, 2,  58],
            ['Втулка №1 (партия 6) 10', 6, 1, 2, 59],

            ['Рычаг №1 (партия 7) 0', 7, 2, 3,  60],
            ['Рычаг №1 (партия 7) 2', 7, 2, 3,  61],
            ['Рычаг №1 (партия 7) 3', 7, 2, 3,  62],
            ['Рычаг №1 (партия 7) 4', 7, 2, 3,  63],
            ['Рычаг №1 (партия 7) 5', 7, 2, 3,  64],
            ['Рычаг №1 (партия 7) 6', 7, 2, 3,  65],
            ['Рычаг №1 (партия 7) 7', 7, 2, 3,  66],
            ['Рычаг №1 (партия 7) 8', 7, 2, 3,  67],
            ['Рычаг №1 (партия 7) 9', 7, 2, 3,  68],
            ['Рычаг №1 (партия 7) 10', 7, 1, 3, 69],

            ['Рычаг №1 (партия 8) 0', 8, 1, 3,  70],
            ['Рычаг №1 (партия 8) 2', 8, 1, 3,  71],
            ['Рычаг №1 (партия 8) 3', 8, 3, 3,  72],
            ['Рычаг №1 (партия 8) 4', 8, 3, 3,  73],
            ['Рычаг №1 (партия 8) 5', 8, 3, 3,  74],
            ['Рычаг №1 (партия 8) 6', 8, 3, 3,  75],
            ['Рычаг №1 (партия 8) 7', 8, 3, 3,  76],
            ['Рычаг №1 (партия 8) 8', 8, 3, 3,  77],
            ['Рычаг №1 (партия 8) 9', 8, 1, 3,  78],
            ['Рычаг №1 (партия 8) 10', 8, 1, 3, 79],

            ['Рычаг №1 (партия 9) 0', 9, 1, 3,  80],
            ['Рычаг №1 (партия 9) 2', 9, 1, 3,  81],
            ['Рычаг №1 (партия 9) 3', 9, 3, 3,  82],
            ['Рычаг №1 (партия 9) 4', 9, 3, 3,  83],
            ['Рычаг №1 (партия 9) 5', 9, 3, 3,  84],
            ['Рычаг №1 (партия 9) 6', 9, 3, 3,  85],
            ['Рычаг №1 (партия 9) 7', 9, 3, 3,  86],
            ['Рычаг №1 (партия 9) 8', 9, 3, 3,  87],
            ['Рычаг №1 (партия 9) 9', 9, 3, 3,  88],
            ['Рычаг №1 (партия 9) 10', 9, 1, 3, 89],

            ['Диск №1 (партия 10) 0', 10, 1, 4,  90],
            ['Диск №1 (партия 10) 2', 10, 1, 4,  91],
            ['Диск №1 (партия 10) 3', 10, 2, 4,  92],
            ['Диск №1 (партия 10) 4', 10, 2, 4,  93],
            ['Диск №1 (партия 10) 5', 10, 2, 4,  94],
            ['Диск №1 (партия 10) 6', 10, 2, 4,  95],
            ['Диск №1 (партия 10) 7', 10, 1, 4,  96],
            ['Диск №1 (партия 10) 8', 10, 1, 4,  97],
            ['Диск №1 (партия 10) 9', 10, 1, 4,  98],
            ['Диск №1 (партия 10) 10', 10, 1, 4, 99],

            ['Цилиндр №1 (партия 11) 0', 11, 3, 5,  101],
            ['Цилиндр №1 (партия 11) 2', 11, 3, 5,  102],
            ['Цилиндр №1 (партия 11) 3', 11, 3, 5,  103],
            ['Цилиндр №1 (партия 11) 4', 11, 3, 5,  104],
            ['Цилиндр №1 (партия 11) 5', 11, 3, 5,  105],
            ['Цилиндр №1 (партия 11) 6', 11, 3, 5,  106],
            ['Цилиндр №1 (партия 11) 7', 11, 3, 5,  107],
            ['Цилиндр №1 (партия 11) 8', 11, 3, 5,  108],
            ['Цилиндр №1 (партия 11) 9', 11, 3, 5,  109],
            ['Цилиндр №1 (партия 11) 10', 11, 1, 5, 110],

            ['Цилиндр №1 (партия 12) 0', 12, 1, 5,  111],
            ['Цилиндр №1 (партия 12) 2', 12, 3, 5,  112],
            ['Цилиндр №1 (партия 12) 3', 12, 3, 5,  113],
            ['Цилиндр №1 (партия 12) 4', 12, 3, 5,  114],
            ['Цилиндр №1 (партия 12) 5', 12, 3, 5,  115],
            ['Цилиндр №1 (партия 12) 6', 12, 3, 5,  116],
            ['Цилиндр №1 (партия 12) 7', 12, 3, 5,  117],
            ['Цилиндр №1 (партия 12) 8', 12, 4, 5,  118],
            ['Цилиндр №1 (партия 12) 9', 12, 4, 5,  119],

            ['Кронштейн №1 (партия 13) 0', 13, 1, 6, 120],
            ['Кронштейн №1 (партия 13) 2', 13, 2, 6, 121],
            ['Кронштейн №1 (партия 13) 3', 13, 2, 6, 122],
            ['Кронштейн №1 (партия 13) 4', 13, 2, 6, 123],
            ['Кронштейн №1 (партия 13) 5', 13, 2, 6, 124],
            ['Кронштейн №1 (партия 13) 6', 13, 2, 6, 125],
            ['Кронштейн №1 (партия 13) 7', 13, 2, 6, 126],
            ['Кронштейн №1 (партия 13) 8', 13, 1, 6, 127],
            ['Кронштейн №1 (партия 13) 9', 13, 1, 6, 128],
            ['Кронштейн №1 (партия 13) 10', 13, 1, 6, 129],

            ['Патрубок №1 (партия 14) 0', 14, 1, 7,  130],
            ['Патрубок №1 (партия 14) 2', 14, 2, 7,  131],
            ['Патрубок №1 (партия 14) 3', 14, 2, 7,  132],
            ['Патрубок №1 (партия 14) 4', 14, 2, 7,  133],
            ['Патрубок №1 (партия 14) 5', 14, 2, 7,  134],
            ['Патрубок №1 (партия 14) 6', 14, 2, 7,  135],
            ['Патрубок №1 (партия 14) 7', 14, 2, 7,  136],
            ['Патрубок №1 (партия 14) 8', 14, 2, 7,  137],
            ['Патрубок №1 (партия 14) 9', 14, 2, 7,  138],
            ['Патрубок №1 (партия 14) 10', 14, 1, 7, 139],

            ['Патрубок №1 (партия 15) 0', 15, 1, 7,  140],
            ['Патрубок №1 (партия 15) 2', 15, 1, 7,  141],
            ['Патрубок №1 (партия 15) 3', 15, 1, 7,  142],
            ['Патрубок №1 (партия 15) 4', 15, 1, 7,  143],
            ['Патрубок №1 (партия 15) 5', 15, 1, 7,  144],
            ['Патрубок №1 (партия 15) 6', 15, 1, 7,  145],
            ['Патрубок №1 (партия 15) 7', 15, 1, 7,  146],
            ['Патрубок №1 (партия 15) 8', 15, 1, 7,  147],
            ['Патрубок №1 (партия 15) 9', 15, 1, 7,  148],
            ['Патрубок №1 (партия 15) 10', 15, 1, 7, 149],

            ['Патрубок №1 (партия 16) 0', 16, 1, 7,  150],
            ['Патрубок №1 (партия 16) 2', 16, 4, 7,  151],
            ['Патрубок №1 (партия 16) 3', 16, 4, 7,  152],
            ['Патрубок №1 (партия 16) 4', 16, 4, 7,  153],
            ['Патрубок №1 (партия 16) 5', 16, 4, 7,  154],
            ['Патрубок №1 (партия 16) 6', 16, 4, 7,  155],
            ['Патрубок №1 (партия 16) 7', 16, 4, 7,  156],
            ['Патрубок №1 (партия 16) 8', 16, 1, 7,  157],
            ['Патрубок №1 (партия 16) 9', 16, 1, 7,  158],
            ['Патрубок №1 (партия 16) 10', 16, 1, 7, 159],

            ['Эксцентриковый вал №1 (партия 17) 0', 17, 3, 17,  160],
            ['Эксцентриковый вал №1 (партия 17) 2', 17, 3, 17,  161],
            ['Эксцентриковый вал №1 (партия 17) 3', 17, 3, 17,  162],
            ['Эксцентриковый вал №1 (партия 17) 4', 17, 3, 17,  163],
            ['Эксцентриковый вал №1 (партия 17) 5', 17, 3, 17,  164],
            ['Эксцентриковый вал №1 (партия 17) 6', 17, 3, 17,  165],
            ['Эксцентриковый вал №1 (партия 17) 7', 17, 3, 17,  166],
            ['Эксцентриковый вал №1 (партия 17) 8', 17, 3, 17,  167],
            ['Эксцентриковый вал №1 (партия 17) 9', 17, 3, 17,  168],
            ['Эксцентриковый вал №1 (партия 17) 10', 17, 1, 17, 169],

            ['Эксцентриковый вал №1 (партия 18) 0', 18, 3, 17,  170],
            ['Эксцентриковый вал №1 (партия 18) 2', 18, 3, 17,  171],
            ['Эксцентриковый вал №1 (партия 18) 3', 18, 3, 17,  172],
            ['Эксцентриковый вал №1 (партия 18) 4', 18, 3, 17,  173],
            ['Эксцентриковый вал №1 (партия 18) 5', 18, 3, 17,  174],
            ['Эксцентриковый вал №1 (партия 18) 6', 18, 3, 17,  175],
            ['Эксцентриковый вал №1 (партия 18) 7', 18, 3, 17,  176],
            ['Эксцентриковый вал №1 (партия 18) 8', 18, 3, 17,  177],
            ['Эксцентриковый вал №1 (партия 18) 9', 18, 3, 17,  178],
            ['Эксцентриковый вал №1 (партия 18) 10', 18, 1, 17, 179],

            ['Эксцентриковый вал №1 (партия 19) 0', 19, 3, 17,  180],
            ['Эксцентриковый вал №1 (партия 19) 2', 19, 3, 17,  181],
            ['Эксцентриковый вал №1 (партия 19) 3', 19, 3, 17,  182],
            ['Эксцентриковый вал №1 (партия 19) 4', 19, 3, 17,  183],
            ['Эксцентриковый вал №1 (партия 19) 5', 19, 3, 17,  184],
            ['Эксцентриковый вал №1 (партия 19) 6', 19, 3, 17,  185],
            ['Эксцентриковый вал №1 (партия 19) 7', 19, 3, 17,  186],
            ['Эксцентриковый вал №1 (партия 19) 8', 19, 3, 17,  187],
            ['Эксцентриковый вал №1 (партия 19) 9', 19, 3, 17,  188],
            ['Эксцентриковый вал №1 (партия 19) 10', 19, 1, 17, 189],
        ];
    }

    public function getDependencies()
    {
        return [TechnologicalMapFixtures::class];
    }
}
