<?php

namespace App\DataFixtures;

use App\Entity\Detail;
use Doctrine\Bundle\FixturesBundle\Fixture;
use Doctrine\Common\DataFixtures\DependentFixtureInterface;
use Doctrine\Persistence\ObjectManager;

class DetailFixtures extends Fixture implements DependentFixtureInterface
{
    public function load(ObjectManager $manager)
    {
        $detail = null;
        foreach (static::getInfo() as $item) {
            $tm = $this->getReference("technological_map_$item[2]");
            $detail = $this->createDetail($item[0], $item[1], $tm);
            $manager->persist($detail);
            $this->addReference("detail_$item[3]", $detail);
        }
        $manager->flush();
    }

    private function createDetail(
        $name,
        $status,
        $tm
    ): Detail
    {
        return (new Detail())
            ->setName($name)
            ->setStatus($status)
            ->setTechnologicalMap($tm)
        ;
    }

    private static function getInfo(): array
    {
        return [
            ['Планка №1 (партия 1) 1', 3, 1, 1],
            ['Планка №1 (партия 1) 2', 4, 1, 2],
            ['Планка №1 (партия 1) 3', 4, 1, 3],
            ['Планка №1 (партия 1) 4', 2, 1, 4],
            ['Планка №1 (партия 1) 5', 2, 1, 5],
            ['Планка №1 (партия 1) 6', 2, 1, 6],
            ['Планка №1 (партия 1) 7', 2, 1, 7],
            ['Планка №1 (партия 1) 8', 2, 1, 8],
            ['Планка №1 (партия 1) 9', 2, 1, 9],
            ['Планка №1 (партия 1) 10', 2, 1, 10],

            ['Планка №1 (партия 2) 1', 2, 1, 11],
            ['Планка №1 (партия 2) 2', 2, 1, 12],
            ['Планка №1 (партия 2) 3', 2, 1, 13],
            ['Планка №1 (партия 2) 4', 2, 1, 14],
            ['Планка №1 (партия 2) 5', 2, 1, 15],
            ['Планка №1 (партия 2) 6', 2, 1, 16],
            ['Планка №1 (партия 2) 7', 2, 1, 17],
            ['Планка №1 (партия 2) 8', 2, 1, 18],
            ['Планка №1 (партия 2) 9', 2, 1, 19],

            ['Планка №1 (партия 3) 0', 2, 1, 20],
            ['Планка №1 (партия 3) 2', 2, 1, 21],
            ['Планка №1 (партия 3) 3', 2, 1, 22],
            ['Планка №1 (партия 3) 4', 2, 1, 23],
            ['Планка №1 (партия 3) 5', 2, 1, 24],
            ['Планка №1 (партия 3) 6', 3, 1, 25],
            ['Планка №1 (партия 3) 7', 3, 1, 26],
            ['Планка №1 (партия 3) 8', 3, 1, 27],
            ['Планка №1 (партия 3) 9', 3, 1, 28],
            ['Планка №1 (партия 3) 10', 1, 1, 29],

            ['Втулка №1 (партия 1) 0', 3, 2,  30],
            ['Втулка №1 (партия 1) 2', 3, 2,  31],
            ['Втулка №1 (партия 1) 3', 3, 2,  32],
            ['Втулка №1 (партия 1) 4', 3, 2,  33],
            ['Втулка №1 (партия 1) 5', 3, 2,  34],
            ['Втулка №1 (партия 1) 6', 3, 2,  35],
            ['Втулка №1 (партия 1) 7', 3, 2,  36],
            ['Втулка №1 (партия 1) 8', 3, 2,  37],
            ['Втулка №1 (партия 1) 9', 3, 2,  38],
            ['Втулка №1 (партия 1) 10', 1, 2, 39],

            ['Втулка №1 (партия 2) 0', 1, 2,  40],
            ['Втулка №1 (партия 2) 2', 2, 2,  41],
            ['Втулка №1 (партия 2) 3', 2, 2,  42],
            ['Втулка №1 (партия 2) 4', 2, 2,  43],
            ['Втулка №1 (партия 2) 5', 2, 2,  44],
            ['Втулка №1 (партия 2) 6', 2, 2,  45],
            ['Втулка №1 (партия 2) 7', 2, 2,  46],
            ['Втулка №1 (партия 2) 8', 1, 2,  47],
            ['Втулка №1 (партия 2) 9', 1, 2,  48],
            ['Втулка №1 (партия 2) 10', 1, 2, 49],

            ['Втулка №1 (партия 3) 0', 1, 2,  50],
            ['Втулка №1 (партия 3) 2', 3, 2,  51],
            ['Втулка №1 (партия 3) 3', 3, 2,  52],
            ['Втулка №1 (партия 3) 4', 3, 2,  53],
            ['Втулка №1 (партия 3) 5', 3, 2,  54],
            ['Втулка №1 (партия 3) 6', 3, 2,  55],
            ['Втулка №1 (партия 3) 7', 3, 2,  56],
            ['Втулка №1 (партия 3) 8', 3, 2,  57],
            ['Втулка №1 (партия 3) 9', 3, 2,  58],
            ['Втулка №1 (партия 3) 10', 1, 2, 59],

            ['Рычаг №1 (партия 1) 0', 2, 3,  60],
            ['Рычаг №1 (партия 1) 2', 2, 3,  61],
            ['Рычаг №1 (партия 1) 3', 2, 3,  62],
            ['Рычаг №1 (партия 1) 4', 2, 3,  63],
            ['Рычаг №1 (партия 1) 5', 2, 3,  64],
            ['Рычаг №1 (партия 1) 6', 2, 3,  65],
            ['Рычаг №1 (партия 1) 7', 2, 3,  66],
            ['Рычаг №1 (партия 1) 8', 2, 3,  67],
            ['Рычаг №1 (партия 1) 9', 2, 3,  68],
            ['Рычаг №1 (партия 1) 10', 1, 3, 69],

            ['Рычаг №1 (партия 2) 0', 1, 3,  70],
            ['Рычаг №1 (партия 2) 2', 1, 3,  71],
            ['Рычаг №1 (партия 2) 3', 3, 3,  72],
            ['Рычаг №1 (партия 2) 4', 3, 3,  73],
            ['Рычаг №1 (партия 2) 5', 3, 3,  74],
            ['Рычаг №1 (партия 2) 6', 3, 3,  75],
            ['Рычаг №1 (партия 2) 7', 3, 3,  76],
            ['Рычаг №1 (партия 2) 8', 3, 3,  77],
            ['Рычаг №1 (партия 2) 9', 1, 3,  78],
            ['Рычаг №1 (партия 2) 10', 1, 3, 79],

            ['Рычаг №1 (партия 3) 0', 1, 3,  80],
            ['Рычаг №1 (партия 3) 2', 1, 3,  81],
            ['Рычаг №1 (партия 3) 3', 3, 3,  82],
            ['Рычаг №1 (партия 3) 4', 3, 3,  83],
            ['Рычаг №1 (партия 3) 5', 3, 3,  84],
            ['Рычаг №1 (партия 3) 6', 3, 3,  85],
            ['Рычаг №1 (партия 3) 7', 3, 3,  86],
            ['Рычаг №1 (партия 3) 8', 3, 3,  87],
            ['Рычаг №1 (партия 3) 9', 3, 3,  88],
            ['Рычаг №1 (партия 3) 10', 1, 3, 89],

            ['Диск №1 (партия 1) 0', 1, 4,  90],
            ['Диск №1 (партия 1) 2', 1, 4,  91],
            ['Диск №1 (партия 1) 3', 2, 4,  92],
            ['Диск №1 (партия 1) 4', 2, 4,  93],
            ['Диск №1 (партия 1) 5', 2, 4,  94],
            ['Диск №1 (партия 1) 6', 2, 4,  95],
            ['Диск №1 (партия 1) 7', 1, 4,  96],
            ['Диск №1 (партия 1) 8', 1, 4,  97],
            ['Диск №1 (партия 1) 9', 1, 4,  98],
            ['Диск №1 (партия 1) 10', 1, 4, 99],

            ['Цилиндр №1 (партия 1) 0', 3, 5,  101],
            ['Цилиндр №1 (партия 1) 2', 3, 5,  102],
            ['Цилиндр №1 (партия 1) 3', 3, 5,  103],
            ['Цилиндр №1 (партия 1) 4', 3, 5,  104],
            ['Цилиндр №1 (партия 1) 5', 3, 5,  105],
            ['Цилиндр №1 (партия 1) 6', 3, 5,  106],
            ['Цилиндр №1 (партия 1) 7', 3, 5,  107],
            ['Цилиндр №1 (партия 1) 8', 3, 5,  108],
            ['Цилиндр №1 (партия 1) 9', 3, 5,  109],
            ['Цилиндр №1 (партия 1) 10', 1, 5, 110],

            ['Цилиндр №1 (партия 2) 0', 1, 5,  111],
            ['Цилиндр №1 (партия 2) 2', 3, 5,  112],
            ['Цилиндр №1 (партия 2) 3', 3, 5,  113],
            ['Цилиндр №1 (партия 2) 4', 3, 5,  114],
            ['Цилиндр №1 (партия 2) 5', 3, 5,  115],
            ['Цилиндр №1 (партия 2) 6', 3, 5,  116],
            ['Цилиндр №1 (партия 2) 7', 3, 5,  117],
            ['Цилиндр №1 (партия 2) 8', 4, 5,  118],
            ['Цилиндр №1 (партия 2) 9', 4, 5,  119],

            ['Кронштейн №1 (партия 3) 0', 1, 6, 120],
            ['Кронштейн №1 (партия 3) 2', 2, 6, 121],
            ['Кронштейн №1 (партия 3) 3', 2, 6, 122],
            ['Кронштейн №1 (партия 3) 4', 2, 6, 123],
            ['Кронштейн №1 (партия 3) 5', 2, 6, 124],
            ['Кронштейн №1 (партия 3) 6', 2, 6, 125],
            ['Кронштейн №1 (партия 3) 7', 2, 6, 126],
            ['Кронштейн №1 (партия 3) 8', 1, 6, 127],
            ['Кронштейн №1 (партия 3) 9', 1, 6, 128],
            ['Кронштейн №1 (партия 3) 10', 1, 6, 129],

            ['Патрубок №1 (партия 1) 0', 1, 7,  130],
            ['Патрубок №1 (партия 1) 2', 2, 7,  131],
            ['Патрубок №1 (партия 1) 3', 2, 7,  132],
            ['Патрубок №1 (партия 1) 4', 2, 7,  133],
            ['Патрубок №1 (партия 1) 5', 2, 7,  134],
            ['Патрубок №1 (партия 1) 6', 2, 7,  135],
            ['Патрубок №1 (партия 1) 7', 2, 7,  136],
            ['Патрубок №1 (партия 1) 8', 2, 7,  137],
            ['Патрубок №1 (партия 1) 9', 2, 7,  138],
            ['Патрубок №1 (партия 1) 10', 1, 7, 139],

            ['Патрубок №1 (партия 2) 0', 1, 7,  140],
            ['Патрубок №1 (партия 2) 2', 1, 7,  141],
            ['Патрубок №1 (партия 2) 3', 1, 7,  142],
            ['Патрубок №1 (партия 2) 4', 1, 7,  143],
            ['Патрубок №1 (партия 2) 5', 1, 7,  144],
            ['Патрубок №1 (партия 2) 6', 1, 7,  145],
            ['Патрубок №1 (партия 2) 7', 1, 7,  146],
            ['Патрубок №1 (партия 2) 8', 1, 7,  147],
            ['Патрубок №1 (партия 2) 9', 1, 7,  148],
            ['Патрубок №1 (партия 2) 10', 1, 7, 149],

            ['Патрубок №1 (партия 3) 0', 1, 7,  150],
            ['Патрубок №1 (партия 3) 2', 4, 7,  151],
            ['Патрубок №1 (партия 3) 3', 4, 7,  152],
            ['Патрубок №1 (партия 3) 4', 4, 7,  153],
            ['Патрубок №1 (партия 3) 5', 4, 7,  154],
            ['Патрубок №1 (партия 3) 6', 4, 7,  155],
            ['Патрубок №1 (партия 3) 7', 4, 7,  156],
            ['Патрубок №1 (партия 3) 8', 1, 7,  157],
            ['Патрубок №1 (партия 3) 9', 1, 7,  158],
            ['Патрубок №1 (партия 3) 10', 1, 7, 159],

            ['Эксцентриковый вал №1 (партия 1) 0', 3, 17,  160],
            ['Эксцентриковый вал №1 (партия 1) 2', 3, 17,  161],
            ['Эксцентриковый вал №1 (партия 1) 3', 3, 17,  162],
            ['Эксцентриковый вал №1 (партия 1) 4', 3, 17,  163],
            ['Эксцентриковый вал №1 (партия 1) 5', 3, 17,  164],
            ['Эксцентриковый вал №1 (партия 1) 6', 3, 17,  165],
            ['Эксцентриковый вал №1 (партия 1) 7', 3, 17,  166],
            ['Эксцентриковый вал №1 (партия 1) 8', 3, 17,  167],
            ['Эксцентриковый вал №1 (партия 1) 9', 3, 17,  168],
            ['Эксцентриковый вал №1 (партия 1) 10', 1, 17, 169],

            ['Эксцентриковый вал №1 (партия 2) 0', 3, 17,  170],
            ['Эксцентриковый вал №1 (партия 2) 2', 3, 17,  171],
            ['Эксцентриковый вал №1 (партия 2) 3', 3, 17,  172],
            ['Эксцентриковый вал №1 (партия 2) 4', 3, 17,  173],
            ['Эксцентриковый вал №1 (партия 2) 5', 3, 17,  174],
            ['Эксцентриковый вал №1 (партия 2) 6', 3, 17,  175],
            ['Эксцентриковый вал №1 (партия 2) 7', 3, 17,  176],
            ['Эксцентриковый вал №1 (партия 2) 8', 3, 17,  177],
            ['Эксцентриковый вал №1 (партия 2) 9', 3, 17,  178],
            ['Эксцентриковый вал №1 (партия 2) 10', 1, 17, 179],

            ['Эксцентриковый вал №1 (партия 3) 0', 3, 17,  180],
            ['Эксцентриковый вал №1 (партия 3) 2', 3, 17,  181],
            ['Эксцентриковый вал №1 (партия 3) 3', 3, 17,  182],
            ['Эксцентриковый вал №1 (партия 3) 4', 3, 17,  183],
            ['Эксцентриковый вал №1 (партия 3) 5', 3, 17,  184],
            ['Эксцентриковый вал №1 (партия 3) 6', 3, 17,  185],
            ['Эксцентриковый вал №1 (партия 3) 7', 3, 17,  186],
            ['Эксцентриковый вал №1 (партия 3) 8', 3, 17,  187],
            ['Эксцентриковый вал №1 (партия 3) 9', 3, 17,  188],
            ['Эксцентриковый вал №1 (партия 3) 10', 1, 17, 189],
        ];
    }

    public function getDependencies()
    {
        return [TechnologicalMapFixtures::class];
    }
}
