<?php

namespace App\DataFixtures;

use App\Entity\WorkerEquipmentDetailProcess;
use Doctrine\Bundle\FixturesBundle\Fixture;
use Doctrine\Common\DataFixtures\DependentFixtureInterface;
use Doctrine\Persistence\ObjectManager;

class WorkerEquipmentDetailProcessFixtures extends Fixture implements DependentFixtureInterface
{
    public function load(ObjectManager $manager)
    {
        $workerEquipmentDetailProcess = null;
        foreach (static::getInfo() as $item) {
            $workerEquipment = $this->getReference("worker_equipment_$item[0]");
            $detail = $this->getReference("detail_$item[2]");
            $workerEquipmentDetailProcess = $this->createWorkerEquipmentDetailProcess($workerEquipment, $item[1], $detail);
            $manager->persist($workerEquipmentDetailProcess);
            $this->addReference("worker_equipment_detail_process_$item[3]", $workerEquipmentDetailProcess);
        }
        $manager->flush();
    }

    private function createWorkerEquipmentDetailProcess(
        $we,
        $time,
        $detail
    ): WorkerEquipmentDetailProcess
    {
        return (new WorkerEquipmentDetailProcess())
            ->setWorkerEquipment($we)
            ->setTime($time)
            ->setDetail($detail)
        ;
    }

    private static function getInfo(): array
    {
        return [

            // Деталь обрабатывают токаря
            [1, rand(40, 180), 1, 1],
            [1, rand(40, 180), 2, 2],
            [1, rand(40, 180), 3, 3],
            [1, rand(40, 180), 4, 4],
            [1, rand(40, 180), 5, 5],
            [1, rand(40, 180), 6, 6],
            [1, rand(40, 180), 7, 7],
            [1, rand(40, 180), 8, 8],
            [1, rand(40, 180), 9, 9],

            [2, rand(40, 180), 10, 10],
            [2, rand(40, 180), 11, 11],
            [2, rand(40, 180), 12, 12],
            [2, rand(40, 180), 13, 13],
            [2, rand(40, 180), 14, 14],
            [2, rand(40, 180), 15, 15],
            [2, rand(40, 180), 16, 16],
            [2, rand(40, 180), 17, 17],
            [2, rand(40, 180), 18, 18],
            [2, rand(40, 180), 19, 19],

            [3, rand(40, 180), 20, 20],
            [3, rand(40, 180), 21, 21],
            [3, rand(40, 180), 22, 22],
            [3, rand(40, 180), 23, 23],
            [3, rand(40, 180), 24, 24],
            [3, rand(40, 180), 25, 25],
            [3, rand(40, 180), 26, 26],
            [3, rand(40, 180), 27, 27],
            [3, rand(40, 180), 28, 28],
            [3, rand(40, 180), 29, 29],

            [3, rand(40, 180), 30, 30],
            [3, rand(40, 180), 31, 31],
            [3, rand(40, 180), 32, 32],
            [3, rand(40, 180), 33, 33],
            [3, rand(40, 180), 34, 34],
            [3, rand(40, 180), 35, 35],
            [3, rand(40, 180), 36, 36],
            [3, rand(40, 180), 37, 37],
            [3, rand(40, 180), 38, 38],
            [3, rand(40, 180), 39, 39],

            [4, rand(40, 180), 40, 40],
            [4, rand(40, 180), 41, 41],
            [4, rand(40, 180), 42, 42],
            [4, rand(40, 180), 43, 43],
            [4, rand(40, 180), 44, 44],
            [4, rand(40, 180), 45, 45],
            [4, rand(40, 180), 46, 46],
            [4, rand(40, 180), 47, 47],
            [4, rand(40, 180), 48, 48],
            [4, rand(40, 180), 49, 49],

            [5, rand(40, 180), 50, 50],
            [5, rand(40, 180), 51, 51],
            [5, rand(40, 180), 52, 52],
            [5, rand(40, 180), 53, 53],
            [5, rand(40, 180), 54, 54],
            [5, rand(40, 180), 55, 55],
            [5, rand(40, 180), 56, 56],
            [5, rand(40, 180), 57, 57],
            [5, rand(40, 180), 58, 58],
            [5, rand(40, 180), 59, 59],

            [6, rand(40, 180), 60, 60],
            [6, rand(40, 180), 61, 61],
            [6, rand(40, 180), 62, 62],
            [6, rand(40, 180), 63, 63],
            [6, rand(40, 180), 64, 64],
            [6, rand(40, 180), 65, 65],
            [6, rand(40, 180), 66, 66],
            [6, rand(40, 180), 67, 67],
            [6, rand(40, 180), 68, 68],
            [6, rand(40, 180), 69, 69],

            [7, rand(40, 180), 70, 70],
            [7, rand(40, 180), 71, 71],
            [7, rand(40, 180), 72, 72],
            [7, rand(40, 180), 73, 73],
            [7, rand(40, 180), 74, 74],
            [7, rand(40, 180), 75, 75],
            [7, rand(40, 180), 76, 76],
            [7, rand(40, 180), 77, 77],
            [7, rand(40, 180), 78, 78],
            [7, rand(40, 180), 79, 79],

            [8, rand(40, 180), 80, 80],
            [8, rand(40, 180), 81, 81],
            [8, rand(40, 180), 82, 82],
            [8, rand(40, 180), 83, 83],
            [8, rand(40, 180), 84, 84],
            [8, rand(40, 180), 85, 85],
            [8, rand(40, 180), 86, 86],
            [8, rand(40, 180), 87, 87],
            [8, rand(40, 180), 88, 88],
            [8, rand(40, 180), 89, 89],

            [9, rand(40, 180), 90, 90],
            [9, rand(40, 180), 91, 91],
            [9, rand(40, 180), 92, 92],
            [9, rand(40, 180), 93, 93],
            [9, rand(40, 180), 94, 94],
            [9, rand(40, 180), 95, 95],
            [9, rand(40, 180), 96, 96],
            [9, rand(40, 180), 97, 97],
            [9, rand(40, 180), 98, 98],
            [9, rand(40, 180), 99, 99],

            // Деталь обрабатывают фрейзеровщики со слесарями
            [10, rand(40, 180), 1, 101],
            [10, rand(40, 180), 2, 102],
            [10, rand(40, 180), 3, 103],
            [10, rand(40, 180), 4, 104],
            [10, rand(40, 180), 5, 105],
            [10, rand(40, 180), 6, 106],
            [10, rand(40, 180), 7, 107],
            [10, rand(40, 180), 8, 108],
            [10, rand(40, 180), 9, 109],

            [11, rand(40, 180), 10, 110],
            [11, rand(40, 180), 11, 111],
            [11, rand(40, 180), 12, 112],
            [11, rand(40, 180), 13, 113],
            [11, rand(40, 180), 14, 114],
            [11, rand(40, 180), 15, 115],
            [11, rand(40, 180), 16, 116],
            [11, rand(40, 180), 17, 117],
            [11, rand(40, 180), 18, 118],
            [11, rand(40, 180), 19, 119],

            [12, rand(40, 180), 20, 120],
            [12, rand(40, 180), 21, 121],
            [12, rand(40, 180), 22, 122],
            [12, rand(40, 180), 23, 123],
            [12, rand(40, 180), 24, 124],
            [12, rand(40, 180), 25, 125],
            [12, rand(40, 180), 26, 126],
            [12, rand(40, 180), 27, 127],
            [12, rand(40, 180), 28, 128],
            [12, rand(40, 180), 29, 129],

            [13, rand(40, 180), 30, 130],
            [13, rand(40, 180), 31, 131],
            [13, rand(40, 180), 32, 132],
            [13, rand(40, 180), 33, 133],
            [13, rand(40, 180), 34, 134],
            [13, rand(40, 180), 35, 135],
            [13, rand(40, 180), 36, 136],
            [13, rand(40, 180), 37, 137],
            [13, rand(40, 180), 38, 138],
            [13, rand(40, 180), 39, 139],

            [14, rand(40, 180), 40, 140],
            [14, rand(40, 180), 41, 141],
            [14, rand(40, 180), 42, 142],
            [14, rand(40, 180), 43, 143],
            [14, rand(40, 180), 44, 144],
            [14, rand(40, 180), 45, 145],
            [14, rand(40, 180), 46, 146],
            [14, rand(40, 180), 47, 147],
            [14, rand(40, 180), 48, 148],
            [14, rand(40, 180), 49, 149],

            [15, rand(40, 180), 50, 150],
            [15, rand(40, 180), 51, 151],
            [15, rand(40, 180), 52, 152],
            [15, rand(40, 180), 53, 153],
            [15, rand(40, 180), 54, 154],
            [15, rand(40, 180), 55, 155],
            [15, rand(40, 180), 56, 156],
            [15, rand(40, 180), 57, 157],
            [15, rand(40, 180), 58, 158],
            [15, rand(40, 180), 59, 159],

            [16, rand(40, 180), 60, 160],
            [16, rand(40, 180), 61, 161],
            [16, rand(40, 180), 62, 162],
            [16, rand(40, 180), 63, 163],
            [16, rand(40, 180), 64, 164],
            [16, rand(40, 180), 65, 165],
            [16, rand(40, 180), 66, 166],
            [16, rand(40, 180), 67, 167],
            [16, rand(40, 180), 68, 168],
            [16, rand(40, 180), 69, 169],

            [17, rand(40, 180), 70, 170],
            [17, rand(40, 180), 71, 171],
            [17, rand(40, 180), 72, 172],
            [17, rand(40, 180), 73, 173],
            [17, rand(40, 180), 74, 174],
            [17, rand(40, 180), 75, 175],
            [17, rand(40, 180), 76, 176],
            [17, rand(40, 180), 77, 177],
            [17, rand(40, 180), 78, 178],
            [17, rand(40, 180), 79, 179],

            [18, rand(40, 180), 80, 180],
            [18, rand(40, 180), 81, 181],
            [18, rand(40, 180), 82, 182],
            [18, rand(40, 180), 83, 183],
            [18, rand(40, 180), 84, 184],
            [18, rand(40, 180), 85, 185],
            [18, rand(40, 180), 86, 186],
            [18, rand(40, 180), 87, 187],
            [18, rand(40, 180), 88, 188],
            [18, rand(40, 180), 89, 189],

            [19, rand(40, 180), 90, 190],
            [19, rand(40, 180), 91, 191],
            [19, rand(40, 180), 92, 192],
            [19, rand(40, 180), 93, 193],
            [19, rand(40, 180), 94, 194],
            [19, rand(40, 180), 95, 195],
            [19, rand(40, 180), 96, 196],
            [19, rand(40, 180), 97, 197],
            [19, rand(40, 180), 98, 198],
            [19, rand(40, 180), 99, 199],
        ];
    }

    public function getDependencies()
    {
        return [DetailFixtures::class, WorkerEquipmentFixtures::class];
    }
}
